# Дана строка, состоящая из слов, разделенных
# пробелами. Определите, сколько в ней слов.
s = input()
k = s.count(' ')
print(k + 1)
