# Дана строка. Удалите из
# этой строки все символы @.
s = input()
k = s.replace('@', '')
print(k)
